const movies = [
  { 
    id: 1,
    title: "슈퍼 마리오 갤럭시", 
    rating: 8.03, 
    genre: "애니메이션", 
    description: "브루클린의 배관공에서 히어로가 된 마리오와 루이지는 모래 왕국에서 요시를 구출하며 새로운 친구를 얻게 된다. 한편 쿠파주니어는 가문의 명예와 아빠 쿠파를 되찾기 위해 로젤리나를 납치하고 버섯 왕국을 위협한다. 마리오 일행은 로젤리나를 구하고 쿠파주니어의 계획을 막기 위해 새로운 갤럭시 모험을 시작한다.", 
    releaseDate: "2026-04-29", 
    poster: null 
  },
  { 
    id: 2,
    title: "악마는 프라다를 입는다 2", 
    rating: 9.20, 
    genre: "드라마", 
    description: "전설적인 패션 매거진 ‘런웨이’가 급변하는 미디어 시장 속 위기를 맞는다. 이를 지키려는 편집장 미란다와 20년 만에 돌아온 앤디, 럭셔리 브랜드 임원이 된 에밀리가 다시 만나 뉴욕 패션계의 치열한 경쟁 속 새로운 이야기를 펼친다.", 
    releaseDate: "2026-04-29", 
    poster: null 
  },
  { 
    id: 3, 
    title: "살목지", 
    rating: 8.39, 
    genre: "공포", 
    description: "기이한 소문이 도는 저수지 살목지 로드뷰에 정체불명의 형체가 포착된다. 재촬영을 위해 현장에 간 PD 수인과 촬영팀은 실종됐던 선배 교식과 마주하고, 설명할 수 없는 사건들이 이어지며 점점 공포 속으로 빠져든다.", 
    releaseDate: "2026-04-08", 
    poster: null 
  },
  { 
    id: 4, 
    title: "프로젝트 헤일메리",   
    rating: 9.21,
    genre: "SF", 
    description: "죽어가는 태양으로 인해 지구가 종말 위기에 놓인 가운데, 과학교사 그레이스는 인류를 구할 마지막 희망으로 우주에서 깨어난다. 잃어버린 기억 속에서 임무를 떠올리던 그는 같은 목적을 가진 존재 로키를 만나, 두 행성의 운명을 건 마지막 미션을 시작한다.", 
    releaseDate: "2026-03-18", 
    poster: null 
  },
  { 
    id: 5, 
    title: "짱구",  
    rating: 8.12, 
    genre: "드라마", 
    description: "배우를 꿈꾸며 서울살이를 시작한 부산 사나이 짱구는 오디션, 생활비, 연애까지 뭐 하나 뜻대로 풀리지 않는다. 하지만 넘어져도 다시 일어나고, 창피해도 웃어넘기며 자신만의 방식으로 꿈을 향해 버틴다.", 
    releaseDate: "2026-04-22", 
    poster: null 
  },
  { 
    id: 6, 
    title: "모탈 컴뱃 2",        
    rating: 9.00, 
    genre: "액션", 
    description: "왕년의 액션 스타 쟈니 케이지는 지구의 운명을 건 전사로 선택되어 잔혹한 모탈 컴뱃 토너먼트에 투입된다. 그는 키타나와 어스렐름 전사들과 함께 궁극의 악 샤오 칸에 맞서 목숨을 건 데스매치에 뛰어든다.", 
    releaseDate: "2026-05-06", 
    poster: null 
  },
];

export default movies;